# Terminal & Shell
brew "zsh"
brew "tmux"
brew "neovim"
brew "starship"

# Window Management (macOS)
cask "alacritty"
cask "nikitabobko/tap/aerospace"
brew "koekeishiya/formulae/skhd"

# CLI Tools (from .zshrc)
brew "git"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "eza"
brew "bat"
brew "lazygit"
brew "zoxide"
brew "vivid"
brew "broot"

# Fonts (Nerd Fonts)
tap "homebrew/cask-fonts"
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
